#_______________________________________________________________________________
#Задача 1.
#Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму 
# элементов списка, стоящих на нечётной позиции.
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12
'''list = [2, 3, 5, 9, 3]
sum = 0
list_new = []
for i in range(1, len(list), 2):
    sum = sum + list[i]
    list_new.append(list[i])
print (list, 'на нечётных позициях элементы', list_new, 'ответ:', sum)'''
#_______________________________________________________________________________
#Задача 2.
# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]
'''list = [2, 3, 4, 5, 6]
st =((len(list))+1)//2
print(len(list))
print (st)
list_multy = []
#for i in st:
for i in range(1, st+1):
    list_multy.append(list[i-1] * list[-i])
    print (list[i-1], list[-i])
    
print(list, '=> ', list_multy)'''
#_______________________________________________________________________________
#Задача 3. 
# Задайте список из вещественных чисел. Напишите программу, которая найдёт 
# разницу между максимальным и минимальным значением дробной части элементов.
# Пример:
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19
list = [1.1, 1.2, 3.1, 5, 10.01]
new_list = []
for i in list:
   if i%1 != 0:
     new_list.append(round(i%1,2))
print(max(new_list) - min(new_list))
#_______________________________________________________________________________
#Задача 4. 
# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10
'''a = int(input('Pвведите число: ')) 
num = ''
while a > 0:
    num = str(a % 2) + num
    a = a // 2
print(f'-> {num}')'''
#_______________________________________________________________________________
#Задача 5. Задайте число. Составьте список чисел Фибоначчи, в том числе для 
# отрицательных индексов.
# Пример:
# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 
# 3, 5, 8, 13, 21]  
'''def Fibonacci(n):
    if n in [1, 2]:                       
        return 1
    else:
        return Fibonacci(n-1) + Fibonacci(n-2)

def NegaFibonacci(n):
    if n == 1:                       
        return 1
    elif n == 2:                       
        return -1
    else:
        num1, num2 = 1, -1
        for i in range(2, n):
            num1, num2 = num2, num1 - num2
        return num2

list = [0]
num = int(input('Pвведите число: '))
for e in range(1, num + 1):
    list.append(Fibonacci(e))
    list.insert(0, NegaFibonacci(e))
print(list)'''
