#_______________________________________________________________________________
#Задача 2.1.
#Напишите программу, которая принимает на вход вещественное число и показывает сумму 
# его цифр.
#Пример:
#6782 -> 23
#0,56 -> 11
#_______________________________________________________________________________
# Вариант 1
'''a = int(input('введите число  '))
res = list(map(int, str(a)))
sum = 0 
for i in range(0, len(res)):
    sum = sum + res[i]
print (a, '->', sum)''' #я понимаю, что мой код считает только целые положительные числа

'''a = int(input('введите число  '))
res = list(filter(lambda x: x == int, a))
print(res)'''

# Вариант 2 (РЕШЕНО)
print('сумма цифр', sum(map(int, list(input('введите число ')))))


#_______________________________________________________________________________
#Задача 2.2
#Напишите программу, которая принимает на вход число N и выдает набор произведений 
# чисел от 1 до N.
#Пример:
#пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)
#_______________________________________________________________________________
# Вариант 1
'''def factorial (number, count = 1):
    for i in range(1, number + 1):
        count *= i
    return count

n = int(input('введите число '))
print(f'N = {n}, тогда ', end = '')
for i in range(1, n + 1):
    if i == n: 
        print(f'{factorial(i)}')
    else:
        print(f'{factorial(i)}', end = ', ')'''
# Вариант 2 (РЕШЕНО)
'''n = int(input('Введите число: '))
f = lambda x: ((x == 1) and 1) or x * factorial(x -1)
list2 = list( f(i) for i in range(1, n +1))
print(list2)'''



#_______________________________________________________________________________
#Задача 3.1.
#Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму 
# элементов списка, стоящих на нечётной позиции.
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12
#_______________________________________________________________________________
# Вариант 1
'''list = [2, 3, 5, 9, 3]
sum = 0
list_new = []
for i in range(1, len(list), 2):
    sum = sum + list[i]
    list_new.append(list[i])
print (list, 'на нечётных позициях элементы', list_new, 'ответ:', sum)'''
# Вариант 2
#lst = [2, 3, 5, 9, 3]

# lst_num = list(enumerate(lst))
# print(lst_num)

#lst_odd = filter(1::2, lst)

#print(lst_odd)

#print(sum(lst[1::2]))

'''def sum_odd_index(lst):
    s = 0
    for i in range(len(lst)):
        if i % 2 != 0:
            s += lst[i]
    print(f"Сумма равна: {s}")

# lst = [2, 3, 5, 9, 3]

lst = list(map(int, input("Введите числа через пробел:\n").split()))
print(lst)
sum_odd_index(lst)'''


#_______________________________________________________________________________
#Задача 3.2.
# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]
#_______________________________________________________________________________
# Вариант 1
'''list = [2, 3, 4, 5, 6]
st =((len(list))+1)//2
print(len(list))
print (st)
list_multy = []
#for i in st:
for i in range(1, st+1):
    list_multy.append(list[i-1] * list[-i])
    print (list[i-1], list[-i])
    
print(list, '=> ', list_multy)'''

#_______________________________________________________________________________
#Задача 3.3
# Задайте список из вещественных чисел. Напишите программу,
# которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
# Пример:
# [1.1, 1.2, 3.1, 5, 10.01] => 0.19
# Вариант 1
'''my_list = [1.1, 1.2, 3.1, 5, 10.01]
min = 1
max = 0
for i in my_list:
    if (i - int(i)) <= min:
        min = i - int(i)
    if (i - int(i)) >= max:
        max = i - int(i)  
print(max-min)'''
# Вариант 2 (РЕШЕНО)
'''my_list = [1.1, 1.2, 3.1, 5, 10.01]
new_list = list(map(lambda x: x % 1, my_list))
print(new_list)
print(max(new_list) - min(new_list))'''